Revit 2027 API
BuiltInFailures.SketchFailures.MissingLapInSketch Property
 Rebar Sketch does not have lapped lengths. A circular shaped Rebar needs overlapping lengths. Please overlap one of the ends of the circular Rebar Sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MissingLapInSketch { get; }
Public Shared ReadOnly Property MissingLapInSketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MissingLapInSketch {
	FailureDefinitionId^ get ();
}
static member MissingLapInSketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace